In [3]:
import pandas as pd
dates = pd.read_csv('movie_lens/dates.csv')
movies = pd.read_csv('movie_lens/movies.csv')
ratings1 = pd.read_csv('movie_lens/ratings1.csv')
ratings2 = pd.read_csv('movie_lens/ratings2.csv')

dates['date'] = pd.to_datetime(dates['date'])

Для объенинения таблиц воспользуемся встроенной функцией Pandas concat(), которая позволяет склеивать (конкатенировать) таблицы как по строкам, так и по столбцам.

Основные параметры функции ___concat()___  
- __objs__ — список объектов DataFrame ([df1, df2,…]), которые должны быть сконкатенированы  
- __axis__ — ось определяет направление конкатенации: 0 — конкатенация по строкам (по умолчанию), 1 — конкатенация по столбцам  
- __join__ — либо _inner_ (пересечение), либо _outer_ (объединение)  
- __ignore_index__ — по умолчанию установлено значение False, которое позволяет значениям индекса оставаться такими, какими они были в исходных данных. Если установлено значение True, параметр будет игнорировать исходные значения и повторно назначать значения индекса в последовательном порядке

Для корректной конкатенации по строкам объединяемые таблицы должны иметь одинаковую структуру — идентичное число и имена столбцов.  
Обратите внимание, что concat является функцией библиотеки, а не методом DataFrame. Поэтому её вызов осуществляется как pd.concat(...).

In [4]:
ratings = pd.concat([ratings1, ratings2])
display(ratings)
# объединили, но нумерация не совпадает с числом строк
# по умолчанию сохранялись первоначальные индексы

       userId  movieId  rating
0           1        1     4.0
1           1        3     4.0
2           1        6     4.0
3           1       47     5.0
4           1       50     5.0
...       ...      ...     ...
60831     610   166534     4.0
60832     610   168248     5.0
60833     610   168250     5.0
60834     610   168252     5.0
60835     610   170875     3.0

[100837 rows x 3 columns]

In [7]:
ratings = pd.concat(
    [ratings1, ratings2],
    ignore_index=True
)
display(ratings)
# вроде все починилось ...

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

In [10]:
#  Узначаем количество строк в таблицах ratings и dates, поскольку их нужно склеить вертикально
print(ratings.shape[0])
print(dates.shape[0])
# не совпадают, а значит при склеивании возникнет ошибка

100837
100836

In [11]:
# возможно, информация попала сразу в обе таблицы
display(ratings1.tail(1))
display(ratings2.head(1))
# так и оказалось

       userId  movieId  rating
40000     274     5621     2.0

   userId  movieId  rating
0     274     5621     2.0

Чтобы очистить таблицу от дублей, мы можем воспользоваться методом DataFrame __drop_duplicates()__, который удаляет повторяющиеся строки в таблице. Не забываем обновить индексы после удаления дублей, выставив параметр ignore_index в методе drop_duplicates() на значение True:

In [13]:
ratings = ratings.drop_duplicates(ignore_index=True)
print(ratings.shape[0])
# теперь количество строк совпадает с dates

100836

In [16]:
# конкатеринуем по столбцам
ratings_dates = pd.concat([ratings, dates], axis=1)
display(ratings_dates.tail(7))

        userId  movieId  rating                date
100829     610   164179     5.0 2017-05-03 21:07:11
100830     610   166528     4.0 2017-05-04 06:29:25
100831     610   166534     4.0 2017-05-03 21:53:22
100832     610   168248     5.0 2017-05-03 22:21:31
100833     610   168250     5.0 2017-05-08 19:50:47
100834     610   168252     5.0 2017-05-03 21:19:12
100835     610   170875     3.0 2017-05-03 21:20:15